ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Reports/vs_АнализПлановогоИФактическогоПотребленияМатериалов/vs_АнализПлановогоИФактическогоПотребленияМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>vs_АнализПлановогоИФактическогоПотребленияМатериалов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладЦеха</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Report>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cc2a9ed0-e83e-4ca4-a99c-1b3eefba4d77">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes>
    <name>vs_СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bab1076-c626-4662-b814-ed3a1973efb8">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e12d08bd-1d79-40a7-b21c-f669b1a7094b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ЭтоДоизготовление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a7dbbbcd-b6fb-4d47-96b7-edcd8cf2d437">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДоизготовить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Reports/vs_АнализПлановогоИФактическогоПотребленияМатериалов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задать настройки формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//         - Неопределено
//   КлючВарианта - Строка
//                - Неопределено
//   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	//Настройки.ОтключитьСтандартноеКонтекстноеМеню = Истина;
	//Настройки.РазрешеноИзменятьСтруктуру = Ложь;
	//Настройки.ФормироватьСразу = Истина;
	//Настройки.События.ПриСозданииНаСервере = Истина;
	//Настройки.События.ПриОпределенииИспользуемыхТаблиц = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	//Настройки.События.ПослеЗагрузкиНастроекВКомпоновщик = Истина;
	Настройки.События.ПередФормированиемОтчета = Истина;
	//Настройки.События.ПриОпределенииПараметровВыбора = Истина;
	
КонецПроцедуры

Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	vs_ОбщийМодуль.vs_МатериальныйОтчет_МО_ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД, СхемаКомпоновкиДанных, ЭтотОбъект);
КонецПроцедуры	

// Параметры:
//   ФормаОтчета - ФормаКлиентскогоПриложения
//   ДополнительныеПараметры - Структура:
//     * ТекстПредупреждения - Строка
//     * ИмяПараметраХраненияОтказаОтПредупреждения - Строка
//
Процедура ПередФормированиемОтчета(ФормаОтчета, ДополнительныеПараметры) Экспорт
	vs_ОбщийМодуль.vs_МатериальныйОтчет_МО_ПередФормированиемОтчета(ФормаОтчета, ДополнительныеПараметры, СхемаКомпоновкиДанных);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Параметры:
//  ДокументРезультат - ТабличныйДокумент
//  ДанныеРасшифровки - ДанныеРасшифровкиКомпоновкиДанных
//  СтандартнаяОбработка - Булево
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	vs_ОбщийМодуль.vs_МатериальныйОтчет_МО_ПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, КомпоновщикНастроек); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстВыпускПродукцииЗатратыНаСборку()
	ТекстЗапроса = "
	|//////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ МассивУзловАИ
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	НЕ ВидыНоменклатуры.ЭтоГруппа
	|	И ВидыНоменклатуры.Наименование ПОДОБНО &Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыО.Период КАК Период,
	|	ТоварыО.Регистратор КАК Регистратор,
	|	ТоварыО.АналитикаУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	КАУН.Номенклатура КАК Номенклатура,
	|	СпрНоменклатура.Родитель КАК РодительНоменклатуры,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КАУН.Характеристика КАК Характеристика,
	|	КАУН.Серия КАК Серия,
	|	КАУН.Назначение КАК Назначение,
	|	КАУН.СкладскаяТерритория КАК Склад,
	|	ТоварыО.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТоварыО.СтатьяРасходов КАК СтатьяРасходов,
	|	ТоварыО.ВидДвижения КАК ВидДвижения,
	|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СпрВидыНоменклатуры.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	СпрПолитикиУчетаСерий.ТипПолитики КАК ТипПолитикиУчетаСерий,
	|	ТоварыО.ВидЗапасов КАК ВидЗапасов,
	//|	ТоварыО.НомерГТД КАК НомерГТД,
	|	ЕСТЬNULL(СУММА(СпрВариантыКомплектацииНоменклатуры.Количество), 0) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ТоварыО
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
	|		ПО ТоварыО.АналитикаУчетаНоменклатуры = КАУН.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СпрВидыНоменклатуры
	|		ПО (СпрНоменклатура.ВидНоменклатуры = СпрВидыНоменклатуры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПолитикиУчетаСерий КАК СпрПолитикиУчетаСерий
	|		ПО (СпрВидыНоменклатуры.ПолитикаУчетаСерий = СпрПолитикиУчетаСерий.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК СпрВариантыКомплектацииНоменклатуры
	|		ПО (КАУН.Номенклатура = СпрВариантыКомплектацииНоменклатуры.Владелец)
	|			И (КАУН.Характеристика = СпрВариантыКомплектацииНоменклатуры.Характеристика)
	|ГДЕ
	|	ТоварыО.Период МЕЖДУ &ДатаНачалаОбщая1 И &ДатаОкончания1
	|	И ТоварыО.Активность = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыО.Период,
	|	ТоварыО.Регистратор,
	|	ТоварыО.АналитикаУчетаНоменклатуры,
	|	КАУН.Номенклатура,
	|	СпрНоменклатура.Родитель,
	|	СпрНоменклатура.ЕдиницаИзмерения,
	|	КАУН.Характеристика,
	|	КАУН.Серия,
	|	КАУН.Назначение,
	|	КАУН.СкладскаяТерритория,
	|	ТоварыО.ХозяйственнаяОперация,
	|	ТоварыО.СтатьяРасходов,
	|	ТоварыО.ВидДвижения,
	|	СпрНоменклатура.ВидНоменклатуры,
	|	СпрВидыНоменклатуры.ПолитикаУчетаСерий,
	|	СпрПолитикиУчетаСерий.ТипПолитики,
	|	ТоварыО.ВидЗапасов//,
	//|	ТоварыО.НомерГТД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;          
	| 	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Период КАК Период,
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ВыпускОбщийИНеГП1
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	|	Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Период КАК Период,
	|	Товары.Регистратор КАК ДокументСборки,
	|	Выпуск.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Выпуск.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Выпуск.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Выпуск.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Выпуск.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Выпуск.ВидЗапасов КАК ВидЗапасов,
	//|	Выпуск.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииПриход) КАК Количество,
	|	СУММА(Товары.ВНаличииПриход) КАК КоличествоУпаковок,
	|	СУММА(Выпуск.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ВыпускОбщийИНеГП2
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачалаОбщая,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В     //, Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					ВыпускОбщийИНеГП1 КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП1 КАК Выпуск
	|		ПО Товары.Регистратор = Выпуск.Регистратор
	|			И Товары.Номенклатура = Выпуск.Номенклатура
	|			И Товары.Характеристика = Выпуск.Характеристика
	|			И Товары.Назначение = Выпуск.Назначение
	|			И Товары.Склад = Выпуск.Склад
	|			И (ВЫБОР КОГДА Выпуск.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Выпуск.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Период,
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Выпуск.КлючАналитикиУчетаНоменклатуры,
	|	Выпуск.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Выпуск.ВидНоменклатуры,
	|	Выпуск.ПолитикаУчетаСерий,
	|	Выпуск.ТипПолитикиУчетаСерий,
	|	Выпуск.ВидЗапасов//,
	//|	Выпуск.НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыпускОбщийИНеГП1
	|; 
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Товары.Период КАК Период,
	//|	Товары.Регистратор КАК Регистратор,
	//|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	//|	Товары.Номенклатура КАК Номенклатура,
	//|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	//|	Товары.Характеристика КАК Характеристика,
	//|	Товары.Серия КАК Серия,
	//|	Товары.Назначение КАК Назначение,
	//|	Товары.Склад КАК Склад,
	//|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	//|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	//|ПОМЕСТИТЬ ВыпускОбщий
	//|ИЗ
	//|	ТоварыО КАК Товары    
	//|ГДЕ
	//|	Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих 
	//|	И Товары.РодительНоменклатуры = &ГотоваяПродукция
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	КлючАналитикиУчетаНоменклатуры,
	//|	Номенклатура,
	//|	Характеристика,
	//|	Серия,
	//|	Назначение,
	//|	Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Товары.Период КАК Период,
	//|	Товары.Регистратор КАК Регистратор,
	//|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	//|	Товары.Номенклатура КАК Номенклатура,
	//|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	//|	Товары.Характеристика КАК Характеристика,
	//|	Товары.Серия КАК Серия,
	//|	Товары.Назначение КАК Назначение,
	//|	Товары.Склад КАК Склад,
	//|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	//|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	//|ПОМЕСТИТЬ Выпуск
	//|ИЗ
	//|	ВыпускОбщий КАК Товары
	//|ГДЕ
	//|	НЕ Товары.Период < &ДатаНачала1
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	КлючАналитикиУчетаНоменклатуры,
	//|	Номенклатура,
	//|	Характеристика,
	//|	Серия,
	//|	Назначение,
	//|	Склад
	//|;
	//|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Период КАК Период,
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ Выпуск
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	|	НЕ Товары.Период < &ДатаНачала1
	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих 
	|	И Товары.РодительНоменклатуры = &ГотоваяПродукция
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////

	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ Списание0
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	|	НЕ Товары.Период < &ДатаНачала1
	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (Товары.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
	|				И Товары.СтатьяРасходов В (&ДопизготовлениеПроизводство))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	
	|
	|////////////////////////////////////////////////////////////////////////////////

	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ Списание
	|ИЗ
	|	Списание0 КАК Товары
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК Сборка
	//|		ПО ВЫРАЗИТЬ(Товары.ДокРег КАК Документ.СборкаТоваров) = Сборка.Ссылка
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	//|		ПО Сборка.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ  Товары.Регистратор В(ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Регистратор ИЗ Выпуск КАК Т)
	// включить условие списания на ГП
	//|	СпрНоменклатура.Родитель = &ГотоваяПродукция
	|	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ИЗ
	|	Списание0 КАК Товары
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Списание0
	|;
	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Период КАК Период,
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ПродажаО
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	|	НЕ Товары.Период < &ДатаНачала1
	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Товары.ХозяйственнаяОперация В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияВРозницу),
	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКомиссионногоТовара))
	|	И НЕ Товары.РодительНоменклатуры = &ГотоваяПродукция
	|	И ЕСТЬNULL(Товары.КоличествоВариантовКомплектацииНоменклатуры,0) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Продажа.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажа.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Продажа.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Продажа.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Продажа.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Продажа.ВидЗапасов КАК ВидЗапасов,
	//|	Продажа.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок,
	|	СУММА(Продажа.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ Продажа
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В     //, Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					ПродажаО КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПродажаО КАК Продажа
	|		ПО Товары.Регистратор = Продажа.Регистратор
	|			И Товары.Номенклатура = Продажа.Номенклатура
	|			И Товары.Характеристика = Продажа.Характеристика
	|			И Товары.Назначение = Продажа.Назначение
	|			И Товары.Склад = Продажа.Склад
	|			И (ВЫБОР КОГДА Продажа.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Продажа.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Продажа.КлючАналитикиУчетаНоменклатуры,
	|	Продажа.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Продажа.ВидНоменклатуры,
	|	Продажа.ПолитикаУчетаСерий,
	|	Продажа.ТипПолитикиУчетаСерий,
	|	Продажа.ВидЗапасов//,
	//|	Продажа.НомерГТД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПродажаО
	|; 
	|  
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВыпускОбщийИНеГП2.Период) КАК Период,
	//|	ВыпускОбщийИНеГП2.ДокументСборки КАК ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры КАК РодительНоменклатуры,
	|	ВыпускОбщийИНеГП2.Номенклатура КАК Номенклатура,
	|	ВыпускОбщийИНеГП2.Характеристика КАК Характеристика,
	|	ВыпускОбщийИНеГП2.Назначение КАК Назначение,
	//|	ВыпускОбщийИНеГП2.Склад КАК Склад,
	//|	ВыпускОбщийИНеГП2.Помещение КАК Помещение,
	|	ВыпускОбщийИНеГП2.Серия КАК Серия	//,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов КАК ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ ПродажаСборкаО
	|ИЗ
	|	Продажа КАК Продажа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП2 КАК ВыпускОбщийИНеГП2
	|		ПО Продажа.Номенклатура = ВыпускОбщийИНеГП2.Номенклатура
	|			И Продажа.Характеристика = ВыпускОбщийИНеГП2.Характеристика
	|			И Продажа.Назначение = ВыпускОбщийИНеГП2.Назначение
	//|			И Продажа.Склад = ВыпускОбщийИНеГП2.Склад
	|			И Продажа.Серия = ВыпускОбщийИНеГП2.Серия
	|
	|СГРУППИРОВАТЬ ПО
	//|	ВыпускОбщийИНеГП2.ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры,
	|	ВыпускОбщийИНеГП2.Номенклатура,
	|	ВыпускОбщийИНеГП2.Характеристика,
	|	ВыпускОбщийИНеГП2.Назначение,
	//|	ВыпускОбщийИНеГП2.Склад,
	//|	ВыпускОбщийИНеГП2.Помещение,
	|	ВыпускОбщийИНеГП2.Серия	//,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД
	|;
	|
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыпускОбщийИНеГП2.ДокументСборки КАК ДокументСборки	//,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры КАК РодительНоменклатуры,
	//|	ВыпускОбщийИНеГП2.Номенклатура КАК Номенклатура,
	//|	ВыпускОбщийИНеГП2.Характеристика КАК Характеристика,
	//|	ВыпускОбщийИНеГП2.Назначение КАК Назначение,
	//|	ВыпускОбщийИНеГП2.Склад КАК Склад,
	//|	ВыпускОбщийИНеГП2.Помещение КАК Помещение,
	//|	ВыпускОбщийИНеГП2.Серия КАК Серия,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов КАК ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД КАК НомерГТД,
	//|	СУММА(ВыпускОбщийИНеГП2.Количество) КАК Количество,
	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоУпаковок) КАК КоличествоУпаковок,
	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ПродажаСборка
	|ИЗ
	|	ПродажаСборкаО КАК ПродажаСборкаО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП2 КАК ВыпускОбщийИНеГП2
	|		ПО ПродажаСборкаО.Период = ВыпускОбщийИНеГП2.Период
	//|			И ПродажаСборкаО.ДокументСборки = ВыпускОбщийИНеГП2.ДокументСборки
	//|			И ПродажаСборкаО.АналитикаУчетаНоменклатуры = ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры
	|			И ПродажаСборкаО.Номенклатура = ВыпускОбщийИНеГП2.Номенклатура
	|			И ПродажаСборкаО.Характеристика = ВыпускОбщийИНеГП2.Характеристика
	|			И ПродажаСборкаО.Назначение = ВыпускОбщийИНеГП2.Назначение
	//|			И ПродажаСборкаО.Склад = ВыпускОбщийИНеГП2.Склад
	|			И ПродажаСборкаО.Серия = ВыпускОбщийИНеГП2.Серия
	|
	//|СГРУППИРОВАТЬ ПО
	//|	ВыпускОбщийИНеГП2.ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры,
	//|	ВыпускОбщийИНеГП2.Номенклатура,
	//|	ВыпускОбщийИНеГП2.Характеристика,
	//|	ВыпускОбщийИНеГП2.Назначение,
	//|	ВыпускОбщийИНеГП2.Склад,
	//|	ВыпускОбщийИНеГП2.Помещение,
	//|	ВыпускОбщийИНеГП2.Серия,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД
	
	|
	|; 
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПродажаСборкаО
	|; 
	|
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ СписаниеПродажа
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	//|	НЕ Товары.Период < &ДатаНачала1
	|	Товары.Регистратор В(ВЫБРАТЬ РАЗЛИЧНЫЕ Т.ДокументСборки ИЗ ПродажаСборка КАК Т)
	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (Товары.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
	|				И Товары.СтатьяРасходов В (&ДопизготовлениеПроизводство))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|

	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПродажаСборка
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ЦеныНомХарактеристик
	|ИЗ
	|	ТоварыО КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаОкончания,
	|				ВидЦены = &ВидЦены
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ТоварыО.Номенклатура
	|						ИЗ
	|							ТоварыО КАК ТоварыО)
	|					И (Характеристика В
	|							(ВЫБРАТЬ
	|								ТоварыО.Характеристика
	|							ИЗ
	|								ТоварыО КАК ТоварыО)
	|						ИЛИ Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ТаблицаТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ТаблицаТоваров.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончания, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончания, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	
	|УНИЧТОЖИТЬ ТоварыО
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Выпуск.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Выпуск.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Выпуск.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Выпуск.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Выпуск.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Выпуск.ВидЗапасов КАК ВидЗапасов,
	//|	Выпуск.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииПриход) КАК Количество,
	|	СУММА(Товары.ВНаличииПриход) КАК КоличествоУпаковок,
	|	СУММА(Выпуск.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В     //, Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					Выпуск КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Выпуск КАК Выпуск
	|		ПО Товары.Регистратор = Выпуск.Регистратор
	|			И Товары.Номенклатура = Выпуск.Номенклатура
	|			И Товары.Характеристика = Выпуск.Характеристика
	|			И Товары.Назначение = Выпуск.Назначение
	|			И Товары.Склад = Выпуск.Склад
	|			И (ВЫБОР КОГДА Выпуск.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Выпуск.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|           //И ложь
	|СГРУППИРОВАТЬ ПО
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Выпуск.КлючАналитикиУчетаНоменклатуры,
	|	Выпуск.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Выпуск.ВидНоменклатуры,
	|	Выпуск.ПолитикаУчетаСерий,
	|	Выпуск.ТипПолитикиУчетаСерий,
	|	Выпуск.ВидЗапасов//,
	//|	Выпуск.НомерГТД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Продажа.ДокументСборки КАК ДокументСборки,
	|	Продажа.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажа.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Продажа.Номенклатура КАК Номенклатура,
	|	Продажа.Характеристика КАК Характеристика,
	|	Продажа.Назначение КАК Назначение,
	|	Продажа.Склад КАК Склад,
	|	Продажа.Помещение КАК Помещение,
	|	Продажа.Серия КАК Серия,
	|	Продажа.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Продажа.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Продажа.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Продажа.ВидЗапасов КАК ВидЗапасов,
	//|	Продажа.НомерГТД КАК НомерГТД,
	|	СУММА(Продажа.Количество) КАК Количество,
	|	СУММА(Продажа.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(Продажа.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ИЗ
	|	Продажа КАК Продажа
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажа.ДокументСборки,
	|	Продажа.АналитикаУчетаНоменклатуры,
	|	Продажа.РодительНоменклатуры,
	|	Продажа.Номенклатура,
	|	Продажа.Характеристика,
	|	Продажа.Назначение,
	|	Продажа.Склад,
	|	Продажа.Помещение,
	|	Продажа.Серия,
	|	Продажа.ВидНоменклатуры,
	|	Продажа.ПолитикаУчетаСерий,
	|	Продажа.ТипПолитикиУчетаСерий,
	|	Продажа.ВидЗапасов//,
	//|	Продажа.НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(ВыпускОбщийИНеГП2.Период) КАК Период,
	//|	ВыпускОбщийИНеГП2.ДокументСборки КАК ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры КАК РодительНоменклатуры,
	//|	ВыпускОбщийИНеГП2.Номенклатура КАК Номенклатура,
	//|	ВыпускОбщийИНеГП2.Характеристика КАК Характеристика,
	//|	ВыпускОбщийИНеГП2.Назначение КАК Назначение,
	//|	ВыпускОбщийИНеГП2.Склад КАК Склад,
	//|	ВыпускОбщийИНеГП2.Помещение КАК Помещение,
	//|	ВыпускОбщийИНеГП2.Серия КАК Серия,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов КАК ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД КАК НомерГТД,
	//|	СУММА(ВыпускОбщийИНеГП2.Количество) КАК Количество,
	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоУпаковок) КАК КоличествоУпаковок,
	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	//|ПОМЕСТИТЬ ПродажаСборка
	//|ИЗ
	//|	ПродажаСборкаО КАК ПродажаСборкаО
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП2 КАК ВыпускОбщийИНеГП2
	//|		ПО ПродажаСборкаО.Период = ВыпускОбщийИНеГП2.Период
	//|			И ПродажаСборкаО.ДокументСборки = ВыпускОбщийИНеГП2.ДокументСборки
	//|			И ПродажаСборкаО.АналитикаУчетаНоменклатуры = ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры
	//|			И ПродажаСборкаО.Номенклатура = ВыпускОбщийИНеГП2.Номенклатура
	//|			И ПродажаСборкаО.Характеристика = ВыпускОбщийИНеГП2.Характеристика
	//|			И ПродажаСборкаО.Назначение = ВыпускОбщийИНеГП2.Назначение
	//|			И ПродажаСборкаО.Склад = ВыпускОбщийИНеГП2.Склад
	//|			И ПродажаСборкаО.Серия = ВыпускОбщийИНеГП2.Серия
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВыпускОбщийИНеГП2.ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры,
	//|	ВыпускОбщийИНеГП2.Номенклатура,
	//|	ВыпускОбщийИНеГП2.Характеристика,
	//|	ВыпускОбщийИНеГП2.Назначение,
	//|	ВыпускОбщийИНеГП2.Склад,
	//|	ВыпускОбщийИНеГП2.Помещение,
	//|	ВыпускОбщийИНеГП2.Серия,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Списание.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Списание.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Списание.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Списание.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Списание.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Списание.ВидЗапасов КАК ВидЗапасов,
	//|	Списание.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок,
	|	СУММА(Списание.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры,
	|   МАКСИМУМ(ЦНХ.Цена) КАК Цена,
	|	СУММА(Товары.ВНаличииРасход) * МАКСИМУМ(ЦНХ.Цена) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В   // , Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					Списание КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Списание КАК Списание
	|		ПО Товары.Регистратор = Списание.Регистратор
	|			И Товары.Номенклатура = Списание.Номенклатура
	|			И Товары.Характеристика = Списание.Характеристика
	|			И Товары.Назначение = Списание.Назначение
	|			И Товары.Склад = Списание.Склад
	|			И (ВЫБОР КОГДА Списание.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Списание.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|           //И ложь
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНомХарактеристик КАК ЦНХ
	|		ПО Товары.Номенклатура = ЦНХ.Номенклатура
	|			И Товары.Характеристика = ЦНХ.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Списание.КлючАналитикиУчетаНоменклатуры,
	|	Списание.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Списание.ВидНоменклатуры,
	|	Списание.ПолитикаУчетаСерий,
	|	Списание.ТипПолитикиУчетаСерий,
	|	Списание.ВидЗапасов//,
	//|	Списание.НомерГТД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Списание.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Списание.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Списание.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Списание.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Списание.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Списание.ВидЗапасов КАК ВидЗапасов,
	//|	Списание.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок,
	|	СУММА(Списание.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры,
	|   МАКСИМУМ(ЦНХ.Цена) КАК Цена,
	|	СУММА(Товары.ВНаличииРасход) * МАКСИМУМ(ЦНХ.Цена) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В   // , Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					СписаниеПродажа КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписаниеПродажа КАК Списание
	|		ПО Товары.Регистратор = Списание.Регистратор
	|			И Товары.Номенклатура = Списание.Номенклатура
	|			И Товары.Характеристика = Списание.Характеристика
	|			И Товары.Назначение = Списание.Назначение
	|			И Товары.Склад = Списание.Склад
	|			И (ВЫБОР КОГДА Списание.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Списание.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНомХарактеристик КАК ЦНХ
	|		ПО Товары.Номенклатура = ЦНХ.Номенклатура
	|			И Товары.Характеристика = ЦНХ.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Списание.КлючАналитикиУчетаНоменклатуры,
	|	Списание.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Списание.ВидНоменклатуры,
	|	Списание.ПолитикаУчетаСерий,
	|	Списание.ТипПолитикиУчетаСерий,
	|	Списание.ВидЗапасов//,
	//|	Списание.НомерГТД
	
	|
	|; 
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Продажа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Выпуск
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Списание
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЦеныНомХарактеристик
	|
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ТаблицаТоваров.ЕдиницаИзмерения",
			"ТаблицаТоваров.Номенклатура"));
			
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстВыпускПродукцииЗатратыНаСборку()

//Процедура РазобратьТекущийНабор(ТаблицаПродукцииРазбор, Знач ПериодОтчетаНачало, Знач ПериодОтчетаКонец, Знач МассивУзловАИ, Знач ТабВыпускПродукцииОбщийИНеГП, Знач ГотоваяПродукция)
Процедура РазобратьТекущийНабор(ТаблицаПродукцииРазбор, Знач ПериодОтчетаНачало, Знач ПериодОтчетаКонец, Знач МассивУзловАИ, ТабВыпускПродукцииОбщийИНеГП, Знач ГотоваяПродукция, Знач ВидЦены)


	Для Каждого СтрокаТ Из ТаблицаПродукцииРазбор Цикл
		
		Струк = Новый Структура("Номенклатура,Характеристика,Серия",СтрокаТ.Номенклатура,СтрокаТ.Характеристика,СтрокаТ.Серия);
		ТаблицаЗапросЭтоЭлемент = ТабВыпускПродукцииОбщийИНеГП.НайтиСтроки(Струк);
		
		Если СтрокаТ.РодительНоменклатуры = ГотоваяПродукция
			или СтрокаТ.КоличествоВариантовКомплектацииНоменклатуры = 0 //Тогда
			или ТаблицаЗапросЭтоЭлемент.Количество() = 0 Тогда
			СтрокаТ.ЭтоЭлемент = ИСТИНА; 
			//СтрокаТ.Обработано = ИСТИНА;
			Продолжить;
			
		Иначе

			//ЗапросРазборКомплекта = Новый Запрос("ВЫБРАТЬ
			//|	Товары.Регистратор КАК ДокументСборки,
			//|	Товары.Номенклатура КАК Номенклатура,
			//|	Товары.Характеристика КАК Характеристика,
			//|	Товары.Назначение КАК Назначение,
			//|	Товары.Склад КАК Склад,
			//|	Товары.Помещение КАК Помещение,
			//|	Товары.Серия КАК Серия,
			//|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК Количество,
			//|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК КоличествоУпаковок,
			//|	ТоварыО.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
			//|ИЗ
			//|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ТоварыО.Регистратор КАК ДокументСборки,
			//|			ТоварыО.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			//|			КлючиА.Номенклатура КАК Номенклатура,
			//|			КлючиА.Характеристика КАК Характеристика,
			//|			КлючиА.Назначение КАК Назначение,
			//|			КлючиА.СкладскаяТерритория КАК Склад,
			//|			КлючиА.Серия КАК Серия
			//|		ИЗ
			//|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыО
			//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиА
			//|				ПО ТоварыО.АналитикаУчетаНоменклатуры = КлючиА.Ссылка
			//|ГДЕ
			//|	ТоварыО.Регистратор = &Регистратор
			//|		
			//|		СГРУППИРОВАТЬ ПО
			//|			ТоварыО.Регистратор,
			//|			КлючиА.Номенклатура,
			//|			КлючиА.Характеристика,
			//|			КлючиА.Назначение,
			//|			КлючиА.СкладскаяТерритория,
			//|			КлючиА.Серия,
			//|			ТоварыО.АналитикаУчетаНоменклатуры) КАК ТоварыО
			//|		ПО Товары.Регистратор = ТоварыО.ДокументСборки
			//|			И Товары.Номенклатура = ТоварыО.Номенклатура
			//|			И Товары.Характеристика = ТоварыО.Характеристика
			//|			И Товары.Назначение = ТоварыО.Назначение
			//|			И Товары.Склад = ТоварыО.Склад
			//|			И (ВЫБОР КОГДА Товары.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
			//|				Товары.Серия = ТоварыО.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
			//|ГДЕ
			//|	Товары.Регистратор = &Регистратор
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	Товары.Назначение,
			//|	Товары.Характеристика,
			//|	Товары.Серия,
			//|	Товары.Помещение,
			//|	Товары.Склад,
			//|	Товары.Регистратор,
			//|	Товары.Номенклатура,
			//|	ТоварыО.АналитикаУчетаНоменклатуры
			//|
			//|ИМЕЮЩИЕ
			//|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) > 0");
			
			ЗапросРазборКомплекта = Новый Запрос("
			
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТоварыО.Регистратор КАК ДокументСборки,
			|	ТоварыО.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			|	ТоварыО.ВидЗапасов КАК ВидЗапасов,   								// fix Suetin 8/29/2024 2:15:12 PM
			|	Ном.ВидНоменклатуры КАК ВидНоменклатуры,                           	// fix Suetin 8/29/2024 2:16:46 PM
			|	ВН.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,                       // fix Suetin 8/29/2024 2:23:24 PM
			|	ПУС.ТипПолитики КАК ТипПолитикиУчетаСерий,                          // fix Suetin 8/29/2024 2:22:56 PM
			|	КлючиА.Номенклатура КАК Номенклатура,
			|	Ном.ЕдиницаИзмерения КАК ЕдиницаИзмерения, 
			|	КлючиА.Характеристика КАК Характеристика,
			|	КлючиА.Назначение КАК Назначение,
			|	КлючиА.СкладскаяТерритория КАК Склад,
			|	КлючиА.Серия КАК Серия
			|ПОМЕСТИТЬ ТоварыОрганизицииО
			|ИЗ
			|	РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиА
			|		ПО ТоварыО.АналитикаУчетаНоменклатуры = КлючиА.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
			|		ПО КлючиА.Номенклатура = Ном.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВН
			|		ПО Ном.ВидНоменклатуры = ВН.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПолитикиУчетаСерий КАК ПУС
			|		ПО ВН.ПолитикаУчетаСерий = ПУС.Ссылка
			
			|ГДЕ
			|	ТоварыО.Регистратор = &Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыО.Регистратор,
			|	КлючиА.Номенклатура,
			|	Ном.ЕдиницаИзмерения,
			|	КлючиА.Характеристика,
			|	КлючиА.Назначение,
			|	КлючиА.СкладскаяТерритория,
			|	КлючиА.Серия,
			|	ТоварыО.АналитикаУчетаНоменклатуры,
			|	ТоварыО.ВидЗапасов,   								// fix Suetin 8/29/2024 2:15:12 PM
			|	Ном.ВидНоменклатуры,                           	// fix Suetin 8/29/2024 2:16:46 PM
			|	ВН.ПолитикаУчетаСерий,                       // fix Suetin 8/29/2024 2:23:24 PM
			|	ПУС.ТипПолитики                          // fix Suetin 8/29/2024 2:22:56 PM
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаТоваров.ДокументСборки				 КАК ДокументСборки,
			|	ТаблицаТоваров.АналитикаУчетаНоменклатуры	 КАК АналитикаУчетаНоменклатуры,
			|	ТаблицаТоваров.Номенклатура					 КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика				 КАК Характеристика,
			|	ТаблицаТоваров.ВидЗапасов 					 КАК ВидЗапасов,   							// fix Suetin 8/29/2024 2:15:12 PM
			|	ТаблицаТоваров.ВидНоменклатуры 				 КАК ВидНоменклатуры,                       // fix Suetin 8/29/2024 2:16:46 PM
			|	ТаблицаТоваров.ПолитикаУчетаСерий 			 КАК ПолитикаУчетаСерий,                    // fix Suetin 8/29/2024 2:23:24 PM
			|	ТаблицаТоваров.ТипПолитикиУчетаСерий 		 КАК ТипПолитикиУчетаСерий,                 // fix Suetin 8/29/2024 2:22:56 PM
			|	ТаблицаТоваров.Назначение					 КАК Назначение,
			|	ТаблицаТоваров.Склад						 КАК Склад,
			|	ТаблицаТоваров.Серия						 КАК Серия,
			|	ТаблицаТоваров.ЕдиницаИзмерения				 КАК ЕдиницаИзмерения,
			|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
			|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
			|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
			|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
			|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
			|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Цена
			|ПОМЕСТИТЬ ТоварыОрганизиции
			|ИЗ
			|	ТоварыОрганизицииО КАК ТаблицаТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&ДатаОкончанияО,
			|				ВидЦены = &ВидЦены
			|					И Номенклатура В
			|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|							ТоварыО.Номенклатура
			|						ИЗ
			|							ТоварыОрганизицииО КАК ТоварыО)
			|					И (Характеристика В
			|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|								ТоварыО.Характеристика
			|							ИЗ
			|								ТоварыОрганизицииО КАК ТоварыО)
			|						ИЛИ Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ТаблицаТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И ТаблицаТоваров.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончанияО, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
			|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончанияО, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
			|		ПО (ИСТИНА)
			|
			//|СГРУППИРОВАТЬ ПО
			//|	ТаблицаТоваров.ДокументСборки,
			//|	ТаблицаТоваров.Номенклатура,
			//|	ТаблицаТоваров.ЕдиницаИзмерения,
			//|	ТаблицаТоваров.Характеристика,
			//|	ТаблицаТоваров.Назначение,
			//|	ТаблицаТоваров.Склад,
			//|	ТаблицаТоваров.Серия,
			//|	ТаблицаТоваров.АналитикаУчетаНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ТоварыОрганизицииО
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Регистратор КАК ДокументСборки,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Назначение КАК Назначение,
			|	Товары.Склад КАК Склад,
			|	Товары.Помещение КАК Помещение,
			|	Товары.Серия КАК Серия,
			|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК Количество,
			|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК КоличествоУпаковок	//,
			//|	ПУС.ТипПолитики КАК ТипПолитикиУчетаСерий
			|ПОМЕСТИТЬ ТоварыНаСкладе
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК Серии
			//|		ПО Товары.Серия = Серии.Ссылка
			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидН
			//|		ПО (Серии.ВидНоменклатуры = ВидН.Ссылка)
			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПолитикиУчетаСерий КАК ПУС
			//|		ПО (ВидН.ПолитикаУчетаСерий = ПУС.Ссылка)
			|ГДЕ
			|	Товары.Регистратор = &Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	Товары.Назначение,
			|	Товары.Характеристика,
			|	Товары.Серия,
			|	Товары.Помещение,
			|	Товары.Склад,
			|	Товары.Регистратор,
			|	Товары.Номенклатура	//,
			//|	ПУС.ТипПолитики
			|
			|ИМЕЮЩИЕ
			|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.ДокументСборки 				КАК ДокументСборки,
			|	Товары.Номенклатура 				КАК Номенклатура,
			|	Товары.Характеристика 				КАК Характеристика,
			|	ТоварыО.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
			|	ТоварыО.ВидЗапасов 					КАК ВидЗапасов,   							// fix Suetin 8/29/2024 2:15:12 PM
			|	ТоварыО.ВидНоменклатуры 			КАК ВидНоменклатуры,                       // fix Suetin 8/29/2024 2:16:46 PM
			|	ТоварыО.ПолитикаУчетаСерий 			КАК ПолитикаУчетаСерий,                    // fix Suetin 8/29/2024 2:23:24 PM
			|	ТоварыО.ТипПолитикиУчетаСерий 		КАК ТипПолитикиУчетаСерий,                 // fix Suetin 8/29/2024 2:22:56 PM
			|	Товары.Назначение 					КАК Назначение,
			|	Товары.Склад 						КАК Склад,
			|	Товары.Помещение 					КАК Помещение,
			|	Товары.Серия 						КАК Серия,
			|	СУММА(Товары.Количество) 			КАК Количество,
			|	СУММА(Товары.КоличествоУпаковок) 	КАК КоличествоУпаковок,
			|	МИНИМУМ(ТоварыО.Цена) 				КАК Цена,
			|	СУММА(Товары.Количество) * МИНИМУМ(ТоварыО.Цена) КАК Сумма
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	ТоварыНаСкладе КАК Товары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыОрганизиции КАК ТоварыО
			|		ПО Товары.ДокументСборки = ТоварыО.ДокументСборки
			|			И Товары.Номенклатура = ТоварыО.Номенклатура
			|			И Товары.Характеристика = ТоварыО.Характеристика
			|			И Товары.Назначение = ТоварыО.Назначение
			|			И Товары.Склад = ТоварыО.Склад
			|			И (ВЫБОР
			|				КОГДА ТоварыО.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям)
			|					ТОГДА Товары.Серия = ТоварыО.Серия
			|				ИНАЧЕ ИСТИНА
			|			КОНЕЦ)
			|
			|СГРУППИРОВАТЬ ПО
			|	Товары.Назначение,
			|	Товары.Характеристика,
			|	Товары.Серия,
			|	Товары.Помещение,
			|	Товары.Склад,
			|	Товары.ДокументСборки,
			|	Товары.Номенклатура,
			|	ТоварыО.АналитикаУчетаНоменклатуры,
			|	ТоварыО.ВидЗапасов,   						// fix Suetin 8/29/2024 2:15:12 PM
			|	ТоварыО.ВидНоменклатуры,                    // fix Suetin 8/29/2024 2:16:46 PM
			|	ТоварыО.ПолитикаУчетаСерий,                 // fix Suetin 8/29/2024 2:23:24 PM
			|	ТоварыО.ТипПолитикиУчетаСерий               // fix Suetin 8/29/2024 2:22:56 PM
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВКН.Владелец 						КАК Номенклатура,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВКН.Ссылка) 	КАК КоличествоВариантовКомплектаций
			|ПОМЕСТИТЬ ВариантыКН
			|ИЗ
			|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВКН
			|ГДЕ
			|	ВКН.ПометкаУдаления = ЛОЖЬ
			|	И ВКН.Владелец В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						Т.Номенклатура
			|					ИЗ
			|						Товары КАК Т)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВКН.Владелец
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.ДокументСборки 				КАК ДокументСборки,
			|	Товары.Номенклатура 				КАК Номенклатура,
			|	Товары.Характеристика 				КАК Характеристика,
			|	Товары.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
			|	Товары.ВидЗапасов 					КАК ВидЗапасов,   							// fix Suetin 8/29/2024 2:15:12 PM
			|	Товары.ВидНоменклатуры 				КАК ВидНоменклатуры,                       // fix Suetin 8/29/2024 2:16:46 PM
			|	Товары.ПолитикаУчетаСерий 			КАК ПолитикаУчетаСерий,                    // fix Suetin 8/29/2024 2:23:24 PM
			|	Товары.ТипПолитикиУчетаСерий 		КАК ТипПолитикиУчетаСерий,                 // fix Suetin 8/29/2024 2:22:56 PM
			|	Товары.Назначение 					КАК Назначение,
			|	Товары.Склад 						КАК Склад,
			|	Товары.Помещение 					КАК Помещение,
			|	Товары.Серия 						КАК Серия,
			|	СУММА(Товары.Количество) 			КАК Количество,
			|	СУММА(Товары.КоличествоУпаковок) 	КАК КоличествоУпаковок,
			|	МИНИМУМ(Товары.Цена) 				КАК Цена,
			|	СУММА(Товары.Сумма) 				КАК Сумма,
			|	СУММА(ЕСТЬNULL(ВариантыКН.КоличествоВариантовКомплектаций, 0)) КАК КоличествоВариантовКомплектацииНоменклатуры
			|ИЗ
			|	Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВариантыКН КАК ВариантыКН
			|		ПО Товары.Номенклатура = ВариантыКН.Номенклатура
			|
			|СГРУППИРОВАТЬ ПО
			|	Товары.Назначение,
			|	Товары.Характеристика,
			|	Товары.Серия,
			|	Товары.Помещение,
			|	Товары.Склад,
			|	Товары.ДокументСборки,
			|	Товары.Номенклатура,
			|	Товары.АналитикаУчетаНоменклатуры,
			|	Товары.ВидЗапасов,   						// fix Suetin 8/29/2024 2:15:12 PM
			|	Товары.ВидНоменклатуры,                    // fix Suetin 8/29/2024 2:16:46 PM
			|	Товары.ПолитикаУчетаСерий,                 // fix Suetin 8/29/2024 2:23:24 PM
			|	Товары.ТипПолитикиУчетаСерий               // fix Suetin 8/29/2024 2:22:56 PM
			|");			
			
			ЗапросРазборКомплекта.Текст = СтрЗаменить(ЗапросРазборКомплекта.Текст,
					"&ТекстЗапросаКоэффициентУпаковки1",
					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
					"ЦеныНоменклатурыСрезПоследних.Упаковка",
					"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
					
			ЗапросРазборКомплекта.Текст = СтрЗаменить(ЗапросРазборКомплекта.Текст,
					"&ТекстЗапросаКоэффициентУпаковки2",
					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
					"ТаблицаТоваров.ЕдиницаИзмерения",
					"ТаблицаТоваров.Номенклатура"));
			
			ДокументСборки = ТаблицаЗапросЭтоЭлемент[0].ДокументСборки;
			//Если ТипЗнч(ДокументСборки) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			//	ДокументСборкиДата = Дата(2000,1,1);
			//	ДокументСборкиКоличество = ТаблицаЗапросЭтоЭлемент[0].Количество;
			//Иначе
				ДокументСборкиДата = ДокументСборки.Дата;
				ДокументСборкиКоличество = ДокументСборки.Количество;
			//КонецЕсли;
			
			ЗапросРазборКомплекта.УстановитьПараметр("Регистратор"     				, ДокументСборки);
			ЗапросРазборКомплекта.УстановитьПараметр("ДатаНачала"					, Новый Граница(НачалоДня(ДокументСборкиДата)));
			ЗапросРазборКомплекта.УстановитьПараметр("ДатаОкончания"				, Новый Граница(КонецДня(ДокументСборкиДата)));
			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектовИсходное"	, ДокументСборкиКоличество);
			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектовИсходное"	, 
				?(ЗапросРазборКомплекта.Параметры.КоличествоКомплектовИсходное = 0, 1, ЗапросРазборКомплекта.Параметры.КоличествоКомплектовИсходное));
			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектов"     	, СтрокаТ.Количество);
			
			ЗапросРазборКомплекта.УстановитьПараметр("ДатаОкончанияО"        , Новый Граница(ПериодОтчетаКонец, Видграницы.Включая));
			ЗапросРазборКомплекта.УстановитьПараметр("Валюта", Справочники.Валюты.НайтиПоКоду("643"));	
			ЗапросРазборКомплекта.УстановитьПараметр("БазоваяВалюта", Справочники.Валюты.НайтиПоКоду("643")); 
			ЗапросРазборКомплекта.УстановитьПараметр("ВидЦены", ВидЦены);

			ТаблицаРазборКомплекта = ЗапросРазборКомплекта.Выполнить().Выгрузить();
			
			Для Каждого СтрокаЗапроса2Р Из ТаблицаРазборКомплекта Цикл
				НоваяСтрокаТаблицыРазбор = ТаблицаПродукцииРазбор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыРазбор, СтрокаЗапроса2Р);
				ИндексМ = МассивУзловАИ.Найти(СтрокаТ.Номенклатура.ВидНоменклатуры);
				Если ИндексМ <> Неопределено Тогда
				    НоваяСтрокаТаблицыРазбор.ЭтоАИ = ИСТИНА;
					НоваяСтрокаТаблицыРазбор.СкладАИ = СтрокаТ.Склад;
				КонецЕсли;
				Если СтрокаТ.ЭтоАИ Тогда
				    НоваяСтрокаТаблицыРазбор.ЭтоАИ = ИСТИНА;
					НоваяСтрокаТаблицыРазбор.СкладАИ = СтрокаТ.СкладАИ;
				КонецЕсли;
			
			КонецЦикла;
			СтрокаТ.Обработано = ИСТИНА;
			ТабВыпускПродукцииОбщийИНеГП.Удалить(ТаблицаЗапросЭтоЭлемент[0]);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
